Revit 2024 API
ExternalDefinition.Description Property
 The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public virtual string Description { get; }
Visual Basic
Public Overridable ReadOnly Property Description As String
	Get
Visual C++
public:
virtual property String^ Description {
	String^ get ();
}
See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace